{"id": "2fl1xx", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Princess_Carolyn\" target=\"_blank\">Princess Carolyn</a>", "<strong>Post: </strong>Princess Carolyn and Vincent theory for season 2.\n\nThis might be a bit of headcanon here but hear me out.\n\n\nWhat's the one thing that Princess doesn't have and is increasingly less likely to have due to age? Children.  Perhaps subconsciously PC is willing to play along with \"Vincent\" and the deception because it allows her to have three children.   She doesn't pursue a physical relationship or ask him to wear anything that would break the illusion so she can maintain the fantasy, the way we indulge young children in make-believe games. it makes Princess happy. Which is her mantra for the second half of the show. \n\n\nMy theory for season 2 is that eventually she'll catch on.  But the children will actually be orphans (or otherwise unattached) that she'll adopt. In a roundabout way finally having the children she'd always wanted in a life-imitates-art way a la Horsin' Around / Mr Peanutbutter's House."]}
{"id": "2g26vx", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/BoJack_Horseman\" target=\"_blank\">Bojack Horseman</a>", "<strong>Post: </strong>My favorite Bojack Horseman quote.\n\n\"In fact, you can burn all books, because my book, written by me, is gonna kick your dick off.\""]}
{"id": "2fixof", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Diane_Nguyen\" target=\"_blank\">Diane Nguyen</a>", "<strong>Post: </strong>Diane = Impossible\n\nSo, having watched this thing five times through, something just finally clicked. Diane wrote Secretariats memoirs before meeting BoJack. She represents the impossible standard of who actually wants (just like the Secretariat the star vs the failure). Maybe not. Whatever."]}
{"id": "2frrhq", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Mr._Peanutbutter\" target=\"_blank\">Mr. Peanutbutter</a>", "<strong>Post: </strong>Although Todd started the season out as BoJack's main companion, by the end, he and Mr. PB shared a closer bond. Yet another animal parallel...\n\nMr. PB literally became man's best friend."]}
{"id": "3dx6p0", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Charlotte_Carson\" target=\"_blank\">Charlotte Carson </a>", "<strong>Post: </strong>[SPOILER!] The emotional difference between the end of S2E10 and S2E11\n\nI don't think a show has ever enticed me so much with a possible happy ending, really made me smile and cheer the way I did at the end of Episode 10. The moment Charlotte showed up and saw BoJack, I hoped that'd be it. I wanted BoJack and Charlotte to be a thing so much. I wanted all that built up tension to release, I wanted Harper to be a thing, I wanted my stupid and unrealistic Hollywood happy ending. I want this stupid, selfish, self-sabatoging, depressed Horseman to be happy because if he can do it maybe I can do it too.   \n   \nThen they crushed me. They managed to get my guard down and managed to get inside and convince me to have hopes and dreams for this fictional horse. Episode 11 was like a nightmare, as I had the charade revealed and saw just how much of a monster this character I'd been rooting for had really become. Then, when I was at my worst, they gave me a small ray of hope with Charlotte's stolen kiss and BoJack turning down Penny on the boat...wait, why is that door still open? Oh god damn it, no. No. NO NO NO NO NO. PLEASE NO. FFFFFFFUUUUUUUUUUUUCK. It'd have been easier if BoJack had simply been caught in an unfortunate circumstance, but instead he was complicit in his failure so there were no excuses to hide behind. There is no rationalizing away his actions to redeem him. He has to live with the horrible thing he did and there's probably no way he'll ever rebuild the bridge he burnt.   \n   \nThis show has torn me apart in a way that no show has ever been able to. I've been angry at character deaths, elated at victories, enthralled by other shows, but no show has ever been able to turn me inside out like this. This is without a doubt the most emotionally jarring show I've ever watched in my life, and its a cartoon about an anthropomorphic horse."]}
{"id": "3eueoo", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/BoJack_Horseman\" target=\"_blank\">Bojack Horseman</a>", "<strong>Post: </strong>The FINAL FINAL Season outcome??\n\nI just finished Episode 11 with charlotte. Maybe this is me but, does anyone else get the hunch that Bojack will commit suicide at some point of his life? He is cutting off nearly everything in his life that makes him somewhat happy because he does not truly know what he wants."]}
{"id": "3f4ztr", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/BoJack_Horseman\" target=\"_blank\">Bojack Horseman</a>", "<strong>Post: </strong>As someone suffering from chronic depression this show really speaks to me...\n\nI just marathoned the last half of season 2 so I don't remember when this was said but, the line that (very approximately) went: \"I don't wake up in the morning looking forward to the day, I don't know how people can do that\" almost made me cry. I haven't had a show hit this close to home in... maybe forever.\n\nGoddamn Bojack, why do you have to be so real to me?"]}
{"id": "3e1esp", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/BoJack_Horseman\" target=\"_blank\">Bojack Horseman</a>", "<strong>Post: </strong>I'm writing a rant titled \"Why I Hate This Goddamn Show, Or: How I Binge Watched The Entire Second Season And Regret Nothing.\" [Possible spoilers all]\n\nThere's just something about this show that makes it so difficult to explain to people. It is deranged, asinine, childish, and above all, unbelievably shallow. An incredibly rich and successful person \"isn't happy with his life\" and he isn't in the limelight anymore like he used to be (even in the second season after his book becomes very successful), and that makes him \"sad.\" He drinks too much and can't maintain meaningful relationships with anyone, pushing everyone who cares for him away. These are very central themes to the show and are also pathetically overdone tropes, shallow storytelling mechanics you should have figured out in your creative writing class.\n\nAnd I'll be damned but this show pulls all of it together beautifully, making these characters and their live's hardships painfully meaningful. The simplicity of the drama makes it deeply human, which while obviously ironic, makes perfect sense for the world they've created. The silly jokes they play out and the subtle continuity of the world they occupy creates a gravity that ties the emotional baggage of the characters to the real world. It makes the bitter life lessons and difficult or poor decisions relatable.\n\nSo I binge watched the whole second season today. And now that it's over I tried telling myself \"okay, it's still early Cap'n, you can watch something else before you need to go to bed and still wake up in time for work tomorrow.\" But I can't. My brain is completely stuck, thinking over and over what the fuck I just watched.\n\n&lt;/rant&gt;"]}
{"id": "3g1lcq", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Sarah_Lynn\" target=\"_blank\">Sarah Lynn</a>", "<strong>Post: </strong>Was Sarah-Lynn sexually abused?\n\nWhile watching season two with a friend we made a joke because of an offhand comment by Sara Lynn but when I started to think about it, it made a lot more sense. \n\nS2:E3 \n“My moms boyfriend home-schools me. He a photographer.”\nSarah Lynn licks the fur in Herbs brief case “Its bear fur. I can tell my step dad was a bear.”\n \nThese two things were given no punch line, said very casually, and never touched on again (to my knowledge).  They do kinda give an implication that her step dad photographed her and quite possibly molested her. Knowing this with a couple other things from season one helped my theory.\n\nHer mom doesn’t care about her- \nS1:E3 The only interaction we see between Sarah Lynn and her mom is negative. Her mom shoots down her dream of becoming an architect, and implies she’s here on the show only because her mom blew an agent. Overall doesn’t mean much but her mom could easily have neglected her and if found out about sexual abuse, do nothing. \n\nShe has sex with Bojack-\nBojack might have been a total tool to her and uncaring, but  never the less could still be seen as another father figure in Sarah Lynn’s early life. Sometime sexual abuse victims will have sexual fantasies relating to their abuse. In this theory Sara Lynn was sexually abuse by her step father, recreating this fantasy would be possible by having sex with another father figure in her life, Bojack Horseman.  \n\nhttp://www.orthodoxwriter.com/2012/07/indications-childhood-sexual-abuse.html, this is just article that explains some of the things I talked about. Other symptoms the article gave could be given to Sarah Lynn like addiction. \nJust a idea that I thought of. If anyone knows anything confirming or denying this theory it would be great to know. \nP.S. any Bojack horseman rule 34 should be called “BoJackin”"]}
{"id": "3e8pu1", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Herb_Kazzaz\" target=\"_blank\">Herb Kazzaz</a>", "<strong>Post: </strong>\"Love Boat\" set is a metaphor for the end of the friendship between BoJack and Herb.\n\n\"Love Boat\" set is a metaphor for the end of the friendship between BoJack and Herb.\n\nAt the end of s02e03 Herb and BoJack sneak onto the set for the \"Love Boat\" and find out that what they thought was a deep tank of water was actually about 2 inches deep. After that BoJack questions Herb about if he thinks everything will change after the show takes off. Herb dismisses BoJack and says that \"the future is bright\" and he motions toward the screen backdrop.\n\nHowever in the final frames of the episode you see that while the backdrop is bright the sun is setting in the background. It symbolizes the pair trying to take on an optimistic attitude when the reality of the situation is darker.\n\nThe sunset signals the beginning of the end."]}
{"id": "3e0qn0", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Charlotte_Carson\" target=\"_blank\">Charlotte Carson </a>", "<strong>Post: </strong>This pissed me off about Charlotte (spoilers)\n\nShe totally kisses him back. Closes her eyes, tongues him, doesn't push him back, then she's like... oh bojack, I think you got the wrong idea. Lady, you aren't guilt free. He didn't \"get the wrong idea\". You were in it too."]}
{"id": "3g0yle", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Butterscotch_Horseman\" target=\"_blank\">Butterscotch Horseman</a>", "<strong>Post: </strong>Anyone notice that in Season 2 Butterscotch sounds just like Bojack, unlike Season 1?\n\nWonder if that was intentional...ie Bojack is becoming like his father\n\nEdit:  I know it's Will Arnett in both seasons, but Butterscotch's voice seemed deeper in Season 1"]}
{"id": "4u8mwk", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/BoJack_Horseman\" target=\"_blank\">Bojack Horseman</a>", "<strong>Post: </strong>Dear Raphael Bob-Waksberg\n\nPlease don't have the show end with Bojack killing himself. I think that it would be the cheapest way to create drama, it's pretty much been predicted by every fan, it would serve no purpose for the story (we already know he's depressed af) and it goes against the show's theme of there always being after whether you like it or not. Please find a way to make him content! Thoughts?"]}
{"id": "4uxj4m", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Herb_Kazzaz\" target=\"_blank\">Herb Kazzaz</a>", "<strong>Post: </strong>So based on what happened with Sarah Lynn...\n\nIt's actually a good thing Bojack abandoned Jerb. He would have ruined his life."]}
{"id": "test1", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/BoJack_Horseman\" target=\"_blank\">BoJack Horseman</a>", "<strong>Post: </strong>I like BoJack so much, I can relate to him in so many ways."]}
{"id": "4t6nee", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Mr._Peanutbutter\" target=\"_blank\">Mr. Peanutbutter</a>", "<strong>Post: </strong>GIF Request: Mr. PB slowly peeks his head in frame at BJ's Golden Globe acceptance speech\n\nI looked online but couldn't find one. Does anyone know if that exists or can make one? I think that moment is fantastic."]}
{"id": "4uc9qm", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Mr._Peanutbutter\" target=\"_blank\">Mr. Peanutbutter</a>", "<strong>Post: </strong>A bit disappointed? [Spoilers]\n\nTo preface this post, I love Bojack and enjoyed this season but as I finished it and had time to reflect on the season, I feel it was incomplete?\nThe show is still wonderful in many ways but this season it felt there wasn't enough development in any direction; from the brilliance of episode 4 with Bojack longing for a daughter it doesn't feel like it was followed upon.  All of the side characters seem forced in and not fleshed out enough, I love PC and Mr. Peanutbutter but it didn't seem as though they were involved enough.  I also loved how grim episode 11 was it seemed to only rehash ideas we've seen before ie. Bojack is broken and wants forgiveness.  Jill Pill felt like she had a major plot line cut out based on the season 2 speculations and Bojack himself felt as though there wasn't enough development, I mean how many times can we see him wallow in self pity?  \nOverall, the season felt incomplete.  Some amazing moments but missing the charm of season 1 and 2.\n\nThis was probably a mistake to post but I'm drunk as a horse so be it  I'd love to hear other's opinions on the season and if it met their expectations."]}
{"id": "4vrq4o", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Princess_Carolyn\" target=\"_blank\">Princess Carolyn</a>", "<strong>Post: </strong>[Small Spoilers] Three dates.\n\nWhen Princess Caroline was talking to Judah about setting her up with some dates and she says something like: \"Set me up on three dates\" I figured Judah would take it seriously, but I thought the \"three dates\" would be Vincent Adultman because he is actually three kids under one trenchcoat pretending to be an adult.\n\nKind of disappointed we didn't get to see him this season, not sure where his relationship with PC stands right now but hopefully we will get to see him next season?"]}
{"id": "4tpskd", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Beatrice_Horseman\" target=\"_blank\">Beatrice Horseman</a>", "<strong>Post: </strong>Just watched \"Yesterdayland\" for the first time.\n\nJust discovered Bojack, and I'm loving it. Started S2 and his Mom telling him he was born broken and he would always be Bojack Horseman and nothing was going to change that made me freaking sob. \n\nAnd the animal gags are so clever. Wanda's \"Who?\" and the bees. Nuff said. \n\nBut I choked on my drink when this joke was said:\n\nWanda: Okay, what if we got relevant superstar David Copperfield to make the World Trade Center disappear?\n\n[long, incredibly awkward silence]\n\nPinky: Uh, I hate to be the one to break this to you, but…David Copperfield isn’t really a big draw anymore.\n\nFucking brilliant. Best animated show since Rick and Morty IMHO."]}
{"id": "4tdskb", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/BoJack_Horseman\" target=\"_blank\">Bojack Horseman</a>", "<strong>Post: </strong>When Bojack appears on Hollywoo Stars and Celebs...\n\nSomething I'm just realizing... Bojack was set up the entire time to fail and everyone involved in the show was in on it. PB was being a dick to Bojack on purpose, not his usually oblivious self, and likely was okay with it considering what Bojack had done to him hence why he was so quick to get real the moment Bojack called him on it. Not to mention the past few episodes PB had been kinda simmering between melancholy and anger over Diane crusade against Hanky.\n\nand now I'm sitting here wondering if PB really did forgive Bojack, because it was sort of an inverse of what what he went through with herb. Except here the suit (wanda) forced a night neat resolution instead of driving a wedge. \n\nWanda also kinda knew that Bojack was suppose to lose as well. She frames it like \"thats what the people on Twitter want\", but really she knew from the start what was going to happen."]}
{"id": "4w5em6", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Sarah_Lynn\" target=\"_blank\">Sarah Lynn</a>", "<strong>Post: </strong>Creepiest change in the intro sequences\n\nThe evening party scene. You know, where the camera \"pans\" around the room to show all of the guests. In every episode up to S3E11, Sara Lynn is partying with the crowd. In E12, she's. . . not there at all."]}
{"id": "4t61i6", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Hank_Hippopopalous\" target=\"_blank\">Hank Hippopopalous</a>", "<strong>Post: </strong>Bojackathon rewatch Season 2 episode 7 Discussion.\n\nThis episode will always be known as Hank Hippopopalous episode. May he be a despised character for the rest of the series. personally i fank Hank a Mix between jay leno and bill cosby (for obvious reasons). also i found todds side adventure not only put in for comedic affect, but also to put in perspective something like what is happening in cordovia and other events of that nature compared to things like Diane's Hank Hippopopulas allegations. Also i cannot wait for tommorows episode! Its one of my Favorites!"]}
{"id": "4uf0au", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/BoJack_Horseman\" target=\"_blank\">Bojack Horseman</a>", "<strong>Post: </strong>Its just you.\n\nThe deepest line in the whole season.\n\nBojack's been wallowing in his depression, drugs, and lifetime disapointments lurching from one bad decision to another, but its not those things that make him do the negative atuff he does.\n\nHe is a shitty person, and his overblown sadness, drugs and disapoinments hide him from that fact.\n\nHe is his own self fulfilling prophecy.\n\nIts just so dark. And i see far too much in myself in this tv show.\n\n."]}
{"id": "4wq8xr", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Sarah_Lynn\" target=\"_blank\">Sarah Lynn</a>", "<strong>Post: </strong>Who killed... [Spoilers]\n\n...Sarah Lynn? I feel like ppl are a bit quick to blame BoJack just cause he's usually the one to blame.\n\nBut to me, at least the events in S3E11 are not his fault. He is a grown up with his own decisions and so is Sarah Lynn. Also, she was the one who invited him to party with her prior.\n\nI think Sarah Lynn was lost way before. And BoJack might have been able to save her ~10 years ago (as implied in the beginning of S3E11) but he didn't fuck her up in the first place, that was the fame.\n\nSo at least in my opinion it isn't BoJacks fault. Diane sums it up pretty well in Sarah Lynn's debut episode:\n\n\"Maybe you could have been a better role model when she was young, but also she never really had a chance. This is what our celebrity culture does to people.\""]}
{"id": "4wwyvf", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Princess_Carolyn\" target=\"_blank\">Princess Carolyn</a>", "<strong>Post: </strong>You cant escape yourself, no mather how hard you try\n\nThat is in my oppinion the message the show deilvers beautifully. Many of us know things that shaped us into who we are as humans. Things in our childhood, our lives.. Many of these things we WANT to change, or think we want to. Example of this: Princess Carolyn thinks she wants to relax. She is stressing herself so much, by being \"the mother/caretaker\" of so many, and especially Bojack. She NEEDS to be needed. A thing she wont admit to herself. It is her drug. Her way of feeling fulfillment. Too much responsiblity at young age, makes people like this. And can also be her motherly nature, that needs to be filled. Since she never had children herself.\n\nChange don't come easy. If at all. To change or revert something within yourself, you need to have an action happen, just as big or bigger, then what shaped you. The stronger force win.\n\nThanks for reading. Have a great day!"]}
{"id": "72k5dv", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/BoJack_Horseman\" target=\"_blank\">Bojack Horseman</a>", "<strong>Post: </strong>\"Stupid Piece of Sh*t\"\n\nThis episode was one of those things that you relate to a little too much for me. I kept going \"Nooo, stop finding ways to relate to Bojack.\" Seriously, everything from eating cookies while yelling at yourself to stop eating cookies, to telling yourself the \"Yeah I'm a piece of shit but at least I know I'm a piece of shit. That makes me better than the other pieces of shit right?\" Thing. There's something so off setting about hearing these things come from someone else, especially a character like Bojack.\n\nAnyone else find this episode disturbingly relatable?"]}
{"id": "70kzwg", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Beatrice_Horseman\" target=\"_blank\">Beatrice Horseman</a>", "<strong>Post: </strong>Beatrice, Henrietta and Hollyhock\n\nI was rewatching 'Stupid Piece of Shit' and the argument between Beatrice and 'Henrietta' (Bojack) about the baby doll made me think the exchange may have been grounded in one of Beatrice's past experiences. Is it possible that Beatrice took Henrietta's baby after is was born, and kept it secretly before being confronted about it? It might explain why Beatrice carried Hollyhock away right after she was born."]}
{"id": "6yyfcv", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Beatrice_Horseman\" target=\"_blank\">Beatrice Horseman</a>", "<strong>Post: </strong>My favourite part of Season 4\n\nWas the character development for Beatrice. Having spent 3 seasons making her an arbitrarily bad person we finally got to see what made her who she is, and at times they made me feel very sympathetic towards her. The crossover scenes between her past and Bojacks present were some of the best in the whole show, and the way they drew parallels between her upbringing and Bojacks do an amazingly depressing job of showing how the cycle of abuse so easily continues.\n\nShowing her mental state decline to the point where she was almost a child in some ways, and as having the capacity to love someone like she did when she was a child was so humanising. When we see Bojack throw the doll out of the window it seems sad at the time, but a couple of episodes later when they show what the doll meant to her and how she was reliving one of the most painful and formative experiences of her life was the most heart-wrenching part of the show so far in my opinion.\n\nWhat was your favourite part of this season?"]}
{"id": "72qiup", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Mr._Peanutbutter\" target=\"_blank\">Mr. Peanutbutter</a>", "<strong>Post: </strong>[Probably spoilers] Mr Peanutbutter's lack of reaction in the \"Underground (4-7)\" episode was weird to me.\n\nSo after everyone gets trapped underground, Bojack and Diane start drinking.  With them being in a separate room from everyone and totally drunk I thought for sure some shenanigans were gonna take place with them.  What we get instead is them just sorting out a few things and mild cuddles, which I thought was nice.\n\nBut fast forward to when the other guests are losing their shit and tie up Mr. Peanutbutter.  They barge into the room and Bojack/Diane's fort collapses and they kinda shuffle under the sheets for a sec then get out.  All Mr. Peanutbutter would see from this is those two fumbling to get out of the sheets, which would be kinda suspicious yeah?  Like the first time I watched the episode I whispered \"oh shit\" to myself because I thought for sure it would raise some conflict, especially since Bojack hasn't really hidden his attraction to her in previous episodes.  \n\nBut things just kinda continue like nothing is wrong.  I mean I guess Mr. Peanutbutter was a little preoccupied with being chosen as a sacrifice but it seemed kinda off to me that he wouldn't at least ask what was going on.  Anyone else thought this was weird?"]}
{"id": "70zqk0", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Diane_Nguyen\" target=\"_blank\">Diane Nguyen </a>", "<strong>Post: </strong>*SPOILERS* Did Diane...?\n\nSleep with BoJack? I just finished watching S4E7, where the crew was stuck underground. BoJack and Diane spent most of their time in the latter's bedroom...drunk. Now this may just be me trying to create unnecessary drama, for BoJack has changed for the better this season. But, if you have the captions on, Diane moaned after she finished the \"asshole\" speech. Is it really that crazy to say that something happened in that seven days they were underground?\n\n\nOr maybe...I'm just going crazy?"]}
{"id": "7073hu", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Joseph_Sugarman\" target=\"_blank\">Joseph Sugarman</a>", "<strong>Post: </strong>Why I think Joseph Sugarman was a bad guy\n\nI've been reading many, many discussions on the wonderful, haunting performance Matthew Broderick gave for Bea's dad, but I don't think I've seen it fully discussed on why specifically he was an asshole.  \n\nI have seen many of the obvious points made (the lobotomy, threatening Bea with the same, etc.) And counter points that \"he is the product of his time\" and so on.  \n\nMy point doesn't delve deep into nuance, instead I opt to make the simple observations.  I understand we are dealing with an unreliable narrator, but This guy was a selfish prick.  He demonstrates little love for his family, and little caring.  We can see it in the way he interrupts his wife and son playing piano.  Obviously this wasn't an evil act, but it hinted at his coldness, not willing to put up with his family having fun, even with his son facing deployment to war.  Also, he showed little care when his son died.  This could also be him just maintaining composure for the family, but given all the other information, I doubt it.  \n\nLong story short, I don't think he was  so much a product of his time, as much as he is how an asshole would be at that time, in that social circle.  I don't think he spoke in the soft, friendly voice to disarm people or because he was nice.  I think he did that because that's what respected members of society did.  I think he pretty much, only cares about how he looks and is thought about by others.  I don't think he was upset at the lobotomy being more destructive than he thought (\"hardly worth the effort \"), I think he was more upset that it didn't have the intended effect, she wasn't easier to manage, now she was another type of burden."]}
{"id": "9ggvzs", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Diane_Nguyen\" target=\"_blank\">Diane Nguyen </a>", "<strong>Post: </strong>Thoughts on Diane.\n\nAm I misunderstanding the show/her character, or is she a toxic person who destroys her relationships because she’s so mopey? Like I didn’t want her and Mr. PB to split, but now I’m actually glad they did because she seems unstable and chronically depressed."]}
{"id": "test2", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Princess_Carolyn\" target=\"_blank\">Princess Carolyn</a>", "<strong>Post: </strong>I don't know why everyone hates Princess Carolyn, I love her character."]}
{"id": "9gbrlw", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Butterscotch_Horseman#:~:text=From%20what%20has%20been%20shown,Butterscotch's%20case%20because%20he%20was\" target=\"_blank\">Butterscotch Horseman</a>", "<strong>Post: </strong>Actually, it was Ibsen (spoilers)\n\nAs pointed out in previous posts  ([link 1](https://www.reddit.com/r/BoJackHorseman/comments/5uao6d/well_it_wasnt_ibsen/)), ([link 2](https://www.reddit.com/r/BoJackHorseman/comments/87027w/the_ibsen_connection_season_4_spoilers/)) by /u/john_mica and /u/trygvebratteli, the show has several connections to Norwegian Playwright Henrik Ibsen. The one that jumped out to me in this latest season was in Free Churro.  \n\nBojack talks about the parties their family had, the ones where he had to dress up and sing the Lollipop song. While Bojack had to perform his humiliating routine, his mother performed the grand finale with a fancy dress. He described it as \"beautiful and sad,\" but mentioned that though his father hated the parties, he always came out to watch his mother dance. In Ibsen's A Doll's House, the main character practices the tarantella with her husband, who thinks of her as a child who must be lectured and scolded, a \"lark\" for his entertainment. In both shows, the husband is insufferable and selfish, holding their wives in contempt except for one moment when they dance.  \n\nI thought it was a cool inspiration. Anyway, go read [\"A Doll's House.\"](https://myetudes.org/access/content/user/mazu48009/PDF%20Files/DollsHouse_full01.pdf)"]}
{"id": "9g9ifa", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Diane_Nguyen\" target=\"_blank\">Diane Nguyen </a>", "<strong>Post: </strong>S5, where Diane adopts Bojack's depression and shitty decisions, Mr. Peanutbutter reaches S1 Diane's self awareness and shortcomings, Todd reaches S1 Princess Carolyn's frustrations, PC adopts some of Mr. P's desire to do everything causing failure, and Bojack becomes a drug addict, shown by:\n\nDiane crying and running away and sleeping with Mr. P, and going on rants about how she's a barge of dumpster fire; Mr. P becoming more mature because he can't handle being with someone so young and his negative sides keep coming out, Todd is trying to juggle everything and has to make difficult decisions about his relationship not being good enough, and he feels wholly incompetent at his job but he has to keep faking it, followed by PC trying to adopt a baby and be a producer and a manager and a roommate and a friend and failing, while Bojack shows one of the truest progressions of how drug addiction alienates friends and family and the denial and defensiveness that accompanies it. It was brilliant.\n\nP.s. I was really on a roll. I just had this really interesting sentence that just went on for pages and pages."]}
{"id": "9gnc3c", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Diane_Nguyen\" target=\"_blank\">Diane Nguyen </a>", "<strong>Post: </strong>[Spoiler-ish] More than one relationship ruined\n\nObviously the relationship Bojack had with Gina is gonezo (she dropped the f-bomb after that silly incident with the strangling and all) but it feels like he also ruined his relationship with Diane and she didn't even have to drop that f-bomb.\n\nTwo reasons I think is that after their fight in episode 10 where after their argument she kick Bojacks (admittedly adorable) float balloon away and its supposed to be a symbolic gesture that she is letting ago of attachment with Bojack.\n\nThe second reason is all of episode 12.  Where she flat out tells him that shes done with doing anything about, for and with him. And lastly when before she drops him off to rehab she says her story about Abby (her high school friend turned cool click enemy) where she said she \"I hated her. But she was my best friend. And she needed me. And I loved her.\"  And then tells Bojack that \"Now, here you are. And I hate you. But, you're my best friend. And you need me.\"  And notice how she never repeated the last line to Bojack.\n\nNow I don't think Diane wants Bojack out of her life, but she can't be with him as they are both people who need to seek help with their personal problems and they can't turn to each other since they are not equipped to deal with the others issues.   \n\nBut this is all my interpretation, I could have missed some points and such but let me know what you guys think."]}
{"id": "9h3xcr", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Princess_Carolyn\" target=\"_blank\">Princess Carolyn</a>", "<strong>Post: </strong>My lore theory based on the new season\n\nOk, listen out.\n\nWhat if Flip was Princess Carolyn all along?\n\nAs Princess Carolyn herself might say: \"Oh, fish!\"\n\nYou see, they seem to consistently hang around each other both during pitching the idea and executing it. It can't be a coincidence that she became a producer for this project specifically. The one time she is away from the set the entire production falls apart like no one is actually managing it. Also, how convenient is it that exactly when she went through a crisis about her baby, a project named Philbert came to her with a starring role perfect for Bojack with whom she had a recent falling out. Flip is also established as an extremely bad writer which fits Princess Carolyn and her lack of writing experience. Also, Flip talks a lot about his \"vision\" but doesn't seem to have any whatsoever. What may have actually happened is that Flip is a representation of her damaged psyche after the tough period in life PC experienced with breaking up and having another miscarriage. She hastily wrote a bad script and promoted it herself.  My theory as to how she presented as Flip to others is that Flip is actually this sort of human sized puppet/costume that she wears and puts on a voice. When she is far away she leaves the office locked and plays recordings. At the end we see everything only from PC's fractured view as the line between her and her secret identity blur until we see her as Flip desperately trying to capture her previous identity. Or as described in extreme elegance by this masterpiece: \"Oh, fish!\"\n\nTl;dr: shitpost"]}
{"id": "9ijh2b", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/BoJack_Horseman\" target=\"_blank\">Bojack Horseman</a>", "<strong>Post: </strong>Spoilers. Will bojack actually go through with it?\n\nYou think boj is gonna really do rehab? I personally don’t buy it. Im expecting the s6 open to be boj storming out and back at home. This is the very same season where he fires his therapist after realizing it was therapy. He didn’t go to rehab after sarah lynn died. I know he choked out this girl and that fucked him up but idk that its enough to spark real change in the guy i mean after the initial guilt wears off everything is basically back to normal the world thinks its just acting according to the interview they did together so does bojack have to own up to anything? Not if he doesn’t want to and I don’t think he wants to. Also its a fucking tv show bojacks not gonna go to rehab and be functional then the fucking show would end did you guys not watch free churro? He basically spelled it out for us, there are no happy endings in tv. Or in real life. Thoughts?"]}
{"id": "9hww34", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Diane_Nguyen\" target=\"_blank\">Diane Nguyen </a>", "<strong>Post: </strong>So let’s talk about Bojack and Diane possibilities... (spoilers)\n\nMore specifically: Do you think they’ll ever hook up? \n\nNot date of course, but i can imagine them making a stupid drunk mistake when they’re down in the dumps followed by immediately regretting it. something along those lines. There were already a couple of very brief moments in the last couple seasons that seemed on the edge of going there"]}
{"id": "9hmztl", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Mr._Peanutbutter\" target=\"_blank\">Mr. Peanutbutter</a>", "<strong>Post: </strong>My girlfriend is Diane and I am Mr.Peanutbutter [HAS S5E1 SPOILER]\n\n&amp;#x200B;\n\nWhen I started watch I already got amazed about the looking and personality (nerd, smart, feminist, full of dreams) similarities between Diane and my GF, but as the series goes shit started to get real. How Mr.Peanutbutter always do nice things and want to impress, when he steals th \"D\" or throw a suprise party, but she hates suprises, once I sneak a chocolate bar into her home so I can make hot chocolate when she wake up and when I woke her up and say \"i made hot chocolate for you :D\" she says \"why did you do that?\" like i was wasting my time, but i have to do this, what is the point of a relationship became a routine, would be booring.\n\nThen I realized that i was like Mr.Peanutbutter, I am nice, kind, playful and sometimes may look like I have no depth, but there are galaxies of thoughts passing through my head. I'm not perfect ok, it's not easy to deal with me sometimes too.\n\n&gt;\" He can be very headstrong and heavily opinionated at times especially in a heated argument to the point of being borderline defensive. Despite Diane constantly voicing her dislike of them, Mr. Peanutbutter constantly tries to impress her with big gestures because he’s scared she’ll get bored of him and leave like his previous wives. There are also traces of nihilism in him. \" THIS IS SOMETHING FROM MR.PB WIKI (frighteningly similar to me)\n\nI am in constant fear that she will left me for a work far away from me (Like Diane went do Cordovia), my girl did went to another city for summer internship (and when she's far away the comunication its like wheN Diane was in Cordovia, really shitty) but she's going again in feburary and june, even already talked about a 6 moths internship really far away, but i support her. I'm always trying not to upset her by complaining, so i swallow alot of shit i don't like.\n\nMy GF have alot of troubles to talk about her feelings, she just keep to herself and i don't have a clues what is going on her mind like Diane have it too, and sometimes she is mean for no reason, probably because of the problems with feelings. She has a bad relationship with her family too and its wierd but long story. Nowdays we are just fighting all the time, but sometimes when we are together everything feels perfect and calm and despite everything I am always nice to her.\n\nSo when I saw the last episode of Season 4 wen Diane says “it's messy, and at first glance, it doesn't seem to make any sense, and it's hard to figure out but sometimes, if you squint at it just right, everything lines up, and it's the most perfect, beautiful, amazing thing” I've never felt so related with any series like that, was amazing.\n\nSeason 5 they're not together...\n\nSorry about bad english, you can point out my writing mistakes on the comments would help me learn.  \n\n\nedit: i broke up"]}
{"id": "9g4uqr", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/BoJack_Horseman\" target=\"_blank\">Bojack Horseman</a>", "<strong>Post: </strong>Episode 10 and our perception of Bojack\n\nI found Diane's confrontation of Bojack really interesting after 4+ seasons of watching him fuck up and hurt people and I'd like to see other people's opinions on what she said. Especially in light of the earlier episodes touching on sexual harassment and whether there's a point where you can't be forgiven anymore.\n\nI think it's interesting that the show finally came out and put forth the idea that maybe we aren't supposed to like or root for Bojack, that he's been given enough chances and blown them all. He's a self destructive, Selfish and manipulative individual who's ruined people's lives time and time again, has it become too late for him? \n\nWhat do you think?"]}
{"id": "doxcx8", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Mr._Peanutbutter\" target=\"_blank\">Mr. Peanutbutter</a>", "<strong>Post: </strong>Theory\n\nSpoiler:\n\n\nI think Mr. PB is going to kill himself. He's quite literally the face of depression. I don't know why but I keep remembering Robin Williams and although many knew he was battling depression, to most people he seemed so happy and cheerful.\n\n\nI don't think BoJack is going to kill himself, i think he's over the fame part. I think he's just going to go Maine and live the small town life\n\n\nor not, whatever"]}
{"id": "dqmrnk", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/BoJack_Horseman\" target=\"_blank\">Bojack Horseman</a>", "<strong>Post: </strong>Bojack should feel guilty as hell [spoilers]\n\nI'm sure many (most of you) realized this right away,  but it just now dawned on me that Bojack absolutely should feel guilty for being responsible for Sarah Lynn's death,  but not just for the obvious reason of encouraging an addict to relapse.   She's an adult, makes her own decisions,  etc.\n\nBut why the hell is he holding onto the (knowingly) lethal Bojack heroin??  Why didn't he stop her saying \"no we gotta toss that, this batch is laced and killed many people already\"?  I know the short answer is it needed to happen for the plot progression,  but still,  he knowingly let her  do poison heroin.  He should be haunted and guilty just for that."]}
{"id": "etocn3", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Todd_Chavez\" target=\"_blank\">Todd Chavez</a>", "<strong>Post: </strong>“But you didn’t fail me because I am not a failure.”\n\nJorge: “I wanted to push you to be your best self. I see now that I failed you.”\n\nTodd: “But you didn’t fail me because I am not a failure. Why do you need to be proud of me on YOUR terms?”\n\nAs someone who grew up around people with high expectations, this line from Todd just hit me so much. BoJack Horseman will always have a special place in my heart. It has made such a huge impact on me, I just know I will never forget it. Th"]}
{"id": "eu02sk", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Todd_Chavez\" target=\"_blank\">Todd Chavez</a>", "<strong>Post: </strong>Best Todd Episode??\n\nI'm pretty sure they have an episode just for Todd but...\nMy friend is finally watching BoJack with me! I thought she'd love Todd as a character so I want to show her a good episode. Any suggestions?"]}
{"id": "eu1k67", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Princess_Carolyn\" target=\"_blank\">Princess Carolyn</a>", "<strong>Post: </strong>My favorite line of the entire series\n\n\"I never hated you. Did you hate me?\"\n\nAfter all the times that Bojack Horseman has made me cry, either from laughter, pity, or the general pulling at my heartstrings, there's one scene I didn't expect to be as impactful as it was for me. Season 6, ep. 2, 'The New Client' at the very end where Princess Carolyn is so exhausted she breaks down in front of her 'mortal enemy' Vanessa Gecko.\n\nFrom the beginning, I expected Gecko to be ruthlessly cruel &amp; snippy to Princess Carolyn but it never came. Nothing that shes said or done while on screen has been intentionally malicious, just a strong willed woman who boasts about how happy she is. That's quite annoying but nothing that I wouldn't expect from our lame universe without underwater cities &amp; stripper dolphins. I take pride in knowing that I'll treat any &amp; everyone with respect as long as long as it's reciprocated. But there I was, a basic bitch that allowed jealousy &amp; rumors fuel my emotions. Not only was this episode empowering but it also called me out on my shit. I automatically jumped on the hating Gecko wagon because I adore PC &amp; identify with her the most but where did that get us? With egg on our face. When I heard that line, I felt such dread &amp; wanted to apologize to a fictional character for unnecessary hostility. It reminded me of a tweet, \"She's not intimidating, you're just intimidated.\" That lesson didn't really resonate within me until this very scene &amp; I'm forever grateful, so I take it with me through every walk of life now."]}
{"id": "enlasy", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Todd_Chavez\" target=\"_blank\">Todd Chavez</a>", "<strong>Post: </strong>I don’t know what I’m going to do without this show.\n\nI’ve related a lot to the characters in the show. Honestly, I’m living just to see the finale. I’m sure some might feel the same way. One of the best shows I’ve ever seen. Regardless of what happens I’m glad to have witnessed it. I love you Bojack, Diane, Todd, Mr. Peanutbutter, and Princes Carolyn. I know you’re fictional but you feel as real to me as anyone else in my life. Thanks for making me feel less alone."]}
{"id": "dxy61f", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/BoJack_Horseman\" target=\"_blank\">Bojack Horseman</a>", "<strong>Post: </strong>Today I have visited an AA group as a guest. It was a really intense experience after watching S6.\n\nI was shocked, how big it was. I've always had people with alcohol-related problems in my family, so the issue itself was familiar, but seeing these folks, who really want to change... It just made me a bit emotional. Especially now, right after when I have seen the latest season. I finally realized that there's a lot of BoJacks in our everyday lives."]}
{"id": "do4wef", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Charlotte_Carson\" target=\"_blank\">Charlotte Carson </a>", "<strong>Post: </strong>[Spoiler] my theory (stay with me on this)\n\nRemember Charlottes F-bomb? “If you contact my family again, I’ll fucking kill you.”  That’s the only explicit threat that has been levied against Bojack. \n\nWhat if she meant it? Bojack goes to New Mexico to try to make amends and Charlotte snaps, either killing him or giving him a near death experience. During this, he speaks to Sarah Lynn, and apologizes to her as well."]}
{"id": "test3", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Diane_Nguyen\" target=\"_blank\">Diane Nguyen</a>", "<strong>Post: </strong>What Diane did to Mr. Peanutbutter is just wrong, I hate her."]}
{"id": "e4xt1h", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Todd_Chavez\" target=\"_blank\">Todd Chavez</a>", "<strong>Post: </strong>Unpopular Opinion (i think?): Bojack Horseman's first episode is a total knockout as far as the pilot episode standards go.\n\nI don't care what most people say, i think the first episode is brilliant and you get hooked to it from the very first scene. \n\nIt's comprehensive. it's clever. excellently executed. introduces all the key characters timely and touches on how they all relate to each other in a brief but precise manner. \n\nNot only that, we are also introduced to main characters in a way that brings to light multiple dimensions of their personality and sets the characteristic pathways from which they seldom deviate in the entire course of the show until the last episodes of the latest season. so here goes: \n\nBojack Horseman: \n\na washed-up 90s actor who refuses to let go of his past glory and endlessly wallows  in slef-pity, consuming self-doubt and crippling depression. has traces of narcissistic and histrionic personality traits.\n\nPrincess Carolyn: \n\nBojack's ex lover/clever hollywoo agent, agentress, agentrix (what's the word grrrh) with an in-your-face kind of attitude, usually blunt but has a kind heart. doesn't harbour grudges. \n\nTodd: \n\na happy-go-lucky harmless character with a shady past who will always be there to hype you up no matter what. sleeps on bojack's couch. \n\nDiane \n\nan intelligent, introverted and awkward writer with a friendly demeanor. supportive and very understanding. an empath. also has her moments (or bouts, if you will) of slef-doubt and feelings of being inadequate. \ndating Mr. PB but in a sexual way. \n\nMr. PeanutButter \n\nextremely extroverted, care-free, and hyperactive. had his own show which co-incidentally resembled Horsing Around in many aspects. constantly makes efforts to become close with bojack. \n\nAND THE 1ST EPISODE SO BRILLIANTLY COVERS ALL OF THESE ASPECTS AND ALSO MANAGES TO DELIVER SOME OF THE MOST HILARIOUS AND WITTY JOKES OF THE ENTIRE SERIES!! truly a genius start to a genius show! \n\ntbh if had to choose an episode to unwind to  after getting home from a long day of getting kicked in the urethra, this one would be it. \n\nso here's to a perfect pilot episode: Bojack Horseman: The Bojack Horseman Story, Chapter One. \n\nHooray!"]}
{"id": "ewdinq", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Princess_Carolyn\" target=\"_blank\">Princess Carolyn</a>", "<strong>Post: </strong>All I want from the last episodes of Bojack Horseman is a tongue twister to end all tongue twisters\n\nC'mon Princess Carolyn, don't let me down"]}
{"id": "dtcux6", "text": ["<strong>Series: </strong>BoJackHorseman", "<strong>Character: </strong><a href=\"https://bojackhorseman.fandom.com/wiki/Diane_Nguyen\" target=\"_blank\">Diane Nguyen </a>", "<strong>Post: </strong>Is Bojack still in love with Diane?\n\nIn season 5, Bojack brings Diane flowers when she invites him to the house-warming party. Then, he seems genuinely hurt when she jokes about him taking advantage of her.\n\nAs it stands in season 6, they are both trying to improve their attitudes and lives. Given what they have been through, maybe they could make a good couple after all? They have helped each other through life-shattering things.\n\nDiane already knows about what happened with Penny, and has processed it. She knows that he was with Sarah Lynn when she died. She already knows his deepest secrets and regrets, and still cares for him. I think she will be his friend no matter what and, if they can improve themselves, their relationship might not be as toxic as I initially thought."]}
