{"id":"1","text":"<strong>Welcome!</strong><br><br>You are about to take part in a study where you will annotate <strong>Reddit posts from the subreddit r/BoJackHorseman</strong>. Each post may mention multiple characters, but for each instance you will be asked to evaluate <strong>only one specific character</strong> (shown with their name and a link to their fandom wiki so you can refresh your memory if needed).<br><br><strong>Your task:</strong><br><ol><li>Read the Reddit post carefully.</li><li>Decide which sentiment(s) the post expresses toward the <strong>given character</strong>. Options: <em>Positive</em>, <em>Neutral</em>, <em>Negative</em>. (You may choose more than one if applicable.)</li><li>If you select <em>Positive</em> or <em>Negative</em>, you must also choose the <strong>reason(s)</strong> for the sentiment from the provided list.</li></ol><br><strong>Reasons for sentiment:</strong><br><ul><li><strong>Adaptation Difference</strong>: The post compares the character to another version (e.g., from a book, another show, or fan expectations) and reacts positively/negatively to the difference.</li><li><strong>Actor Appearance</strong>: The sentiment is about the <em>actor</em> playing the role (looks, voice, reputation) rather than the character’s actions.</li><li><strong>Fandom Echo</strong>: The sentiment seems influenced by <em>popular opinions, memes, or community trends</em> rather than the poster’s own reasoning.</li><li><strong>Character Development & Complexity</strong>: The reaction is based on how <em>deep, well-written, or shallow</em> the character feels, or how much they grow/change during the story.</li><li><strong>Plot Reaction</strong>: The sentiment comes from specific <em>story events</em> involving the character (e.g., shock at a twist, approval of an outcome, grief over a loss).</li><li><strong>Logical Actions</strong>: The character is liked because their behavior makes sense in context, or disliked because their actions feel <em>illogical or inconsistent</em>.</li><li><strong>Humor or Entertainment</strong>: The character is appreciated for being <em>funny, witty, charming, or otherwise entertaining</em>.</li><li><strong>Narrative Transport</strong>: The post shows immersion in the story, reacting to the character <em>as if they were real</em> (e.g., “I can’t believe she did this to us”).</li><li><strong>Viewpoint Divergence</strong>: The sentiment comes from a <em>different interpretation</em> of the character or scene compared to other fans.</li><li><strong>Relatability</strong>: The reaction is based on <em>personal identification</em> (the poster relates to the character’s struggles) or <em>group identity</em> (defending/praising due to gender, race, background, etc.).</li><li><strong>Moral Judgment</strong>: The character’s actions are judged as <em>ethical or unethical</em>, or their treatment is seen as morally fair/unfair.</li><li><strong>Moral Justification</strong>: The poster <em>excuses or rationalizes bad behavior</em> because they like the character (e.g., victim-blaming or double standards).</li><li><strong>Loyalty Reward</strong>: The sentiment comes from <em>longstanding fan loyalty</em>—supporting or defending a character simply because they’ve always liked them.</li><li><strong>Narrative Justice</strong>: The poster expresses a desire for <em>justice in the story</em>, e.g., wanting good characters to succeed and bad ones to be punished.</li></ul><br>Tooltips are provided for each reason to help refresh your memory as you annotate. Thank you for participating!", "schema":"pure_display","choices":[""]}
{"id":"7","text":"I have read and understood the instructions.","schema":"radio","choices":["Yes","No"],"label_requirement":{"right_label":["Yes"]}}
{"id":"8","text":"I agree to participate in this study.","schema":"radio","choices":["Yes","No"],"label_requirement":{"right_label":["Yes"]}}
